** COMMENT Spaceline
- https://www.reddit.com/r/emacs/comments/3mq61l/spaceline_spacemacs_modeline_extracted_as_a/
- https://github.com/TheBB/spaceline/tree/master#why-does-it-look-different

- Es la mejor mode line so far but as all, a bit invasive. With it, some outcomes in =ewww= had a very weird formatting, going across the window to the right and with a huge empty space in the middle. Don't know why.

To play in future:  (from https://daemons.it/pages/mi-configuracion-de-emacs/)

#+BEGIN_EXAMPLE
(setq powerline-default-separator "wave")

option:
    :after (circadian minions)

#+END_EXAMPLE

#+begin_src emacs-lisp :tangle no
  (use-package spaceline
    :after (minions)
    :init
    (minions-mode 1)
    (require 'spaceline-config)
    :config
    (spaceline-emacs-theme)
    (minions-mode 1)
    (spaceline-helm-mode 1)
    (spaceline-info-mode 1)
    (spaceline-toggle-org-clock-on)
    (spaceline-toggle-version-control-on)
    (spaceline-toggle-selection-info-on)
    (spaceline-toggle-buffer-encoding-on)
    (spaceline-toggle-buffer-encoding-abbrev-on)
    (spaceline-toggle-hud-on)
    (spaceline-toggle-anzu-on)
    (spaceline-toggle-projectile-root-on)
    (spaceline-toggle-which-function-on)
    (spaceline-toggle-major-mode-off)
    (spaceline-toggle-minor-modes-on) ;; or else minions don't work
    (setq powerline-default-separator 'rounded)
    (spaceline-define-segment line-column
      "The current line and column numbers."
      "l:%l c:%2c")
    (spaceline-define-segment time
      "The current time."
      (format-time-string "%H:%M"))
    (spaceline-define-segment date
      "The current date."
      (format-time-string "%h %d"))
    (spaceline-toggle-time-on)
    (spaceline-emacs-theme 'date 'time)
    (spaceline-define-segment minor-modes
      (if (bound-and-true-p minions-mode)
          (format-mode-line minions-mode-line-modes)
        (spaceline-minor-modes-default)))
    (format-mode-line minions-mode-line-modes)
    )
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24236 33258 615065 656000) :init (24236 33258 615057 423000) :config (24236 33258 614949 293000) :config-secs (0 1 387482 0) :init-secs (0 1 387884 767000) :use-package-secs (0 1 388088 433000)))

NB: parece que adding this does not make that minions are used. Minions only take effect when I run manually the above chunk, why??? Aclarar en =use-package= si :config es para cosas que se ponen antes o luego

#+BEGIN_EXAMPLE
    (spaceline-define-segment minor-modes
      (if (bound-and-true-p minions-mode)
          (format-mode-line minions-mode-line-modes)
        (spaceline-minor-modes-default)))

    (format-mode-line minions-mode-line-modes)
#+END_EXAMPLE


*** COMMENT My =get-spaceline-working= function

Goal: to make colors and minions work whenever I toggle solarized theme.

#+begin_src emacs-lisp :tangle no
;; my function to get spaceline powerline working

(defun get-spaceline-working ()
  "Set spaceline with time, date and minions."
  (interactive)
    (spaceline-emacs-theme)
    (minions-mode 1)
    (spaceline-helm-mode 1)
    (spaceline-info-mode 1)
    (spaceline-toggle-org-clock-on)
    (spaceline-toggle-version-control-on)
    (spaceline-toggle-selection-info-on)
    (spaceline-toggle-buffer-encoding-on)
    (spaceline-toggle-buffer-encoding-abbrev-on)
    (spaceline-toggle-hud-on)
    (spaceline-toggle-anzu-on)
    (spaceline-toggle-projectile-root-on)
    (spaceline-toggle-which-function-on)
    (spaceline-toggle-major-mode-off)
    (spaceline-toggle-minor-modes-on) ;; or else minions don't work
    (setq powerline-default-separator 'rounded)
    (spaceline-define-segment line-column
      "The current line and column numbers."
      "l:%l c:%2c")
    (spaceline-define-segment time
      "The current time."
      (format-time-string "%H:%M"))
    (spaceline-define-segment date
      "The current date."
      (format-time-string "%h %d"))
    (spaceline-toggle-time-on)
    (spaceline-emacs-theme 'date 'time)
    (spaceline-define-segment minor-modes
      (if (bound-and-true-p minions-mode)
          (format-mode-line minions-mode-line-modes)
        (spaceline-minor-modes-default)))
    (format-mode-line minions-mode-line-modes)
    (set-face-attribute 'helm-selection nil 
                        :background nil
                        :foreground "Orange3")
    (set-face-attribute 'helm-source-header
                        nil
                        :foreground "#dcdcdc")
  )
#+end_src

  ;; Install additinal themes from melpa
  ;; make sure to use :defer keyword
  ;; (use-package apropospriate-theme :ensure :defer)
  ;; (use-package nord-theme :ensure :defer)
  ;; (use-package tao-theme 
  ;;  :ensure 
  ;;  :defer
  ;;  :custom
  ;;  (tao-theme-use-sepia t)
  ;;  (tao-theme-use-boxes nil)
  ;;  (tao-theme-sepia-saturation 1.5))

If you want your Emacs automatically switch between the color schemes when the time come, you can use run-with-timer function to do the check every hour. But hey, if if I switch theme manually, theme is switched back to what it was after one hour.
- New, simplified costumization.

#+BEGIN_SRC emacs-lisp :tangle no
  (defun set-light-theme ()
    "Set the light theme with some customization if needed."
    (interactive)
    (load-theme 'solarized-light t))

  (defun set-dark-theme ()
    "Set the dark theme with some customization if needed."
    (interactive)
    (load-theme 'solarized-dark t))

  (let ((current-hour (string-to-number (format-time-string "%H"))))
    (if (or (< current-hour 9) (> current-hour 20)) (set-dark-theme) (set-light-theme)))
#+END_SRC

#+RESULTS:

- DGM disables on april 2020 to see if above works

#+BEGIN_SRC emacs-lisp :tangle no
(defun theme-switcher ()
  (let ((current-hour (string-to-number (format-time-string "%H"))))
    (if (or (< current-hour 11) (> current-hour 17)) (set-dark-theme) (set-light-theme))))

;; Run at every 3600 seconds, after 0s delay; DGM commented this out on 24 august 2019 so it did not switch back by itself 
(run-with-timer 0 3600 'theme-switcher)
#+END_SRC

#+RESULTS:
: [nil 24021 32824 946091 3600 theme-switcher nil nil 677000]

*** COMMENT Spaceline
- https://www.reddit.com/r/emacs/comments/3mq61l/spaceline_spacemacs_modeline_extracted_as_a/
- https://github.com/TheBB/spaceline/tree/master#why-does-it-look-different

- Es la mejor mode line so far but as all, a bit invasive. With it, some outcomes in =ewww= had a very weird formatting, going across the window to the right and with a huge empty space in the middle. Don't know why.

To play in future:  (from https://daemons.it/pages/mi-configuracion-de-emacs/)

#+BEGIN_EXAMPLE
(setq powerline-default-separator "wave")
#+END_EXAMPLE

#+begin_src emacs-lisp :tangle no 
  (use-package spaceline
;;    :after (circadian minions)
    :init
    (minions-mode 1)
    (require 'spaceline-config)
    :config
    (spaceline-emacs-theme)
    (spaceline-helm-mode 1)
    (spaceline-info-mode 1)
    (spaceline-toggle-org-clock-on)
    (spaceline-toggle-version-control-on)
    (spaceline-toggle-selection-info-on)
    (spaceline-toggle-buffer-encoding-on)
    (spaceline-toggle-buffer-encoding-abbrev-on)
    (spaceline-toggle-hud-on)
    (spaceline-toggle-anzu-on)
    (spaceline-toggle-projectile-root-on)
    (spaceline-toggle-which-function-on)
    (spaceline-toggle-major-mode-off)
    (spaceline-toggle-minor-modes-on) ;; or else minions don't work
    (setq powerline-default-separator 'rounded)
    (spaceline-define-segment line-column
      "The current line and column numbers."
      "l:%l c:%2c")
    (spaceline-define-segment time
      "The current time."
      (format-time-string "%H:%M"))
    (spaceline-define-segment date
      "The current date."
      (format-time-string "%h %d"))
    (spaceline-toggle-time-on)
    (spaceline-emacs-theme 'date 'time)
    )
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24220 30766 282997 112000) :init (24220 30766 282959 706000) :config (24220 30766 282763 993000) :config-secs (0 1 895181 651000) :init-secs (0 1 896199 854000) :use-package-secs (0 1 896698 413000)))

NB: parece que adding this does not make that minions are used. Minions only take effect when I run manually the above chunk, why??? Aclarar en =use-package= si :config es para cosas que se ponen antes o luego

#+BEGIN_EXAMPLE
    (spaceline-define-segment minor-modes
      (if (bound-and-true-p minions-mode)
          (format-mode-line minions-mode-line-modes)
        (spaceline-minor-modes-default)))

    (format-mode-line minions-mode-line-modes)
#+END_EXAMPLE


*** COMMENT Smart mode line

From: https://github.com/Malabarba/smart-mode-line

Interesting. To experiment further in future. 

#+begin_src emacs-lisp :tangle no
(use-package smart-mode-line)
(sml/setup)
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24219 4737 472515 20000) :init (24219 4737 472502 325000) :config (24219 4737 472197 211000) :config-secs (0 0 7 340000) :init-secs (0 0 78018 100000) :use-package-secs (0 3 23061 911000)))

